#+begin_src shader
R = (cos(210.0*x*y + 5.0*t) + 1.0) / 2.0;
G = (cos(200.0*x*y + 5.0*t) + 1.0) / 2.0;
B = (cos(10.0*x*y + 5.0*t) + 1.0) / 2.0;
#+end_src

#+RESULTS:
: {SHADER}


#+begin_src shader
float z = sin(a * 10.0 + r * 15.0 - t * 5.0);
R = G = 0.5 + 0.5 * sin(z + t * 0.1);
B = 0.5 + 0.4 * sin(10.0*z + t * 0.2);
#+end_src

#+RESULTS:
: {SHADER}
